<a href="https://colab.research.google.com/github/ARBINDA765/Pandas_Notes/blob/master/Pandas_Assigment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.Introduction
This assignment will help you to consolidate the concepts learnt in the session.
2.Problem Statement
It happens all the time: someone gives you data containing malformed strings,
Python, lists and missing data. How do you tidy it up so you can get on with the
analysis?
Take this monstrosity as the DataFrame to use in the following puzzles:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
1. Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).
2. The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.
3. Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)
4. Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.
5. In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each
second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.
Note: Solution submitted via github must contain all the source code and output.
3. Expected Output
This assignment consists of 200 marks and has to be submitted in .ipynb format in
the upcoming session for evaluation.# New section

In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [2]:
#NO-1
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

In [3]:
#NO-2
temp = df.From_To.str.split('_', expand=True)
temp.columns = ['From','To']

In [4]:
#N0-3
temp['From']=temp['From'].str.capitalize()
temp['To']=temp['To'].str.capitalize()

In [5]:
#NO-4
del df['From_To']
df.join(temp)

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [6]:
#NO-5
delays_flight = df['RecentDelays'].apply(pd.Series)

delays_flight.columns = ['delay_{}'.format(n) for n in range(1, len(delays_flight.columns)+1)]

df = df.drop('RecentDelays', axis=1)

df=df.join(delays_flight)

df

   FlightNumber              Airline  delay_1  delay_2  delay_3
0         10045               KLM(!)     23.0     47.0      NaN
1         10055    <Air France> (12)      NaN      NaN      NaN
2         10065  (British Airways. )     24.0     43.0     87.0
3         10075       12. Air France     13.0      NaN      NaN
4         10085          "Swiss Air"     67.0     32.0      NaN